<!-- dflook/terraform-github-actions {"workspace":"kub1k","backend_type":"local","backend":"b568fdea3c94e150021ee5cc3f44617e0a14d80f11225770a98dd3dcb8db703a","plan_job_ref":"Job Terraform Plan #100 at https://github.com/ironashram/kub1k/actions/runs/11985129138","plan_out_hash":"a648a426d5ec4477bf5e6791f879e75104450a8019bc5fefee8d6201b2ffc4a7","plan_hash":"9931c5749a3e63b2625741508803380196de88c0fde13a422b775f69bbfeb1a1","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform__ in the __kub1k__ workspace
<details>
<summary>Plan: 1 to add, 2 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.provision_apps[0].helm_release.cilium will be updated in-place
!~  resource "helm_release" "cilium" {
        id                         = "cilium"
        name                       = "cilium"
!~      version                    = "1.16.3" -> "1.16.4"
#        (27 unchanged attributes hidden)
    }

  # module.provision_k3s.data.local_sensitive_file.kubeconfig will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "local_sensitive_file" "kubeconfig" {
+       content              = (sensitive value)
+       content_base64       = (sensitive value)
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       filename             = "/github/home/.kube/config-files/kub1k.yaml"
+       id                   = (known after apply)
    }

  # module.provision_k3s.null_resource.k3s_kubeconfig must be replaced
-/+ resource "null_resource" "k3s_kubeconfig" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "timestamp" = "2024-11-16T17:47:12Z" -> (known after apply)
        }
    }

  # module.provision_k3s.vault_kv_secret_v2.k3s will be updated in-place
!~  resource "vault_kv_secret_v2" "k3s" {
!~      data_json           = (sensitive value)
        id                  = "kv/data/kub1k/k3s"
        name                = "kub1k/k3s"
#        (6 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #100](https://github.com/ironashram/kub1k/actions/runs/11985129138)